https://machinelearningmastery.com/multivariate-time-series-forecasting-lstms-keras/  
https://www.justintodata.com/forecast-time-series-lstm-with-tensorflow-keras/

In [36]:
import pandas as pd
import warnings
import datetime
warnings.filterwarnings('ignore')

Vix index with data cut down to first of month only

In [67]:
vix_df = pd.read_csv('/home/jeremy/data/eco/^VIX.csv')

In [68]:
vix_df

,Date,Open,High,Low,Close,Adj Close,Volume
0,1990-01-02,17.240000,17.240000,17.240000,17.240000,17.240000,0
1,1990-01-03,18.190001,18.190001,18.190001,18.190001,18.190001,0
2,1990-01-04,19.219999,19.219999,19.219999,19.219999,19.219999,0
3,1990-01-05,20.110001,20.110001,20.110001,20.110001,20.110001,0
4,1990-01-08,20.260000,20.260000,20.260000,20.260000,20.260000,0
...,...,...,...,...,...,...,...
7730,2020-09-04,34.619999,38.279999,29.500000,30.750000,30.750000,0
7731,2020-09-08,30.610001,35.930000,30.520000,31.459999,31.459999,0
7732,2020-09-09,31.680000,31.780001,28.120001,28.809999,28.809999,0
7733,2020-09-10,28.670000,30.559999,27.590000,29.709999,29.709999,0
7734,2020-09-11,28.629999,29.730000,26.510000,26.870001,26.870001,0

In [69]:
def getFirstDayOfMonth(df):
    df = df[['Date','Close']]
    df['Date']=  pd.to_datetime(vix_df['Date'], format='%Y-%m-%d')
    df = df.groupby(pd.Grouper(key='Date',freq="1M")).nth(0)   
    df.reset_index(drop=True,inplace=True)
    return df

In [70]:
vix_df = getFirstDayOfMonth(vix_df)

In [75]:
vix_df.head()

        Date      Close
0 1990-01-02  17.240000
1 1990-02-01  24.870001
2 1990-03-01  21.900000
3 1990-04-02  22.840000
4 1990-05-01  18.430000

https://stackoverflow.com/questions/25797038/filter-data-to-get-only-first-day-of-the-month-rows

==================================================================================================================

CPI

In [43]:
cpi_df = pd.read_csv('/home/jeremy/data/eco/CPIAUCSL.csv')

In [44]:
cpi_df['Date']=  pd.to_datetime(cpi_df['DATE'], format='%Y-%m-%d')

===============================================================================================================

Dow Jones Transport

In [72]:
djt_df = pd.read_csv('/home/jeremy/data/eco/^DJT.csv')

In [73]:
djt_df = getFirstDayOfMonth(djt_df)

In [74]:
djt_df.head()

        Date        Close
0 1990-01-02  1342.099976
1 1990-02-01  1350.699951
2 1990-03-01  1365.500000
3 1990-04-02  1383.000000
4 1990-05-01  1380.400024

===============================================================================================================

2 yr note

In [78]:
twoyr_df = pd.read_csv('/home/jeremy/data/eco/DGS2.csv')

In [79]:
twoyr_df

            DATE   DGS2
0     1990-01-02  7.870
1     1990-01-03  7.940
2     1990-01-04  7.920
3     1990-01-05  7.900
4     1990-01-08  7.900
...          ...    ...
8018  2020-09-25   0.12
8019  2020-09-28   0.14
8020  2020-09-29   0.11
8021  2020-09-30   0.13
8022  2020-10-01   0.14

[8023 rows x 2 columns]

In [80]:
twoyr_df.columns = ['Date','Close']
twoyr_df = getFirstDayOfMonth(twoyr_df)

In [82]:
twoyr_df.head()

        Date  Close
0 1990-01-02  7.870
1 1990-02-01  7.940
2 1990-03-01  7.920
3 1990-04-02  7.900
4 1990-05-01  7.900

===============================================================================================================

10 yr note

In [83]:
tenyr_df = pd.read_csv('/home/jeremy/data/eco/DGS10.csv')
tenyr_df.columns = ['Date','Close']
tenyr_df = getFirstDayOfMonth(tenyr_df)

In [84]:
tenyr_df.head()

        Date Close
0 1990-01-02  7.94
1 1990-02-01  7.99
2 1990-03-01  7.98
3 1990-04-02  7.99
4 1990-05-01  8.02

===============================================================================================================

5 yr note

In [89]:
fiveyr_df = pd.read_csv('/home/jeremy/data/eco/^FVX.csv')
# fiveyr_df.columns = ['Date','Close']
fiveyr_df = getFirstDayOfMonth(fiveyr_df)

In [90]:
fiveyr_df.head()

        Date  Close
0 1990-01-02   3.88
1 1990-02-01   3.87
2 1990-03-01   3.86
3 1990-04-02   3.89
4 1990-05-01    NaN

===============================================================================================================

SP 500 PE Ratio

In [95]:
peRatio_df = pd.read_csv('/home/jeremy/data/eco/MULTPL-SP500_PE_RATIO_MONTH.csv')
peRatio_df.columns = ['Date','Close']
peRatio_df = getFirstDayOfMonth(peRatio_df)

In [96]:
peRatio_df.dtypes

Date     datetime64[ns]
Close           float64
dtype: object

In [98]:
peRatio_df.head()

        Date  Close
0 1990-01-02  30.32
1 1990-02-01  30.09
2 1990-03-01  29.16
3 1990-04-02  28.12
4 1990-05-01  27.57

===============================================================================================================

Unemployment Rate

In [101]:
urate_df = pd.read_csv('/home/jeremy/data/eco/UNRATE.csv')
urate_df.columns = ['Date','Close']
urate_df = getFirstDayOfMonth(urate_df)

In [102]:
 urate_df

          Date  Close
0   1990-01-02    3.4
1   1990-02-01    3.8
2   1990-03-01    4.0
3   1990-04-02    3.9
4   1990-05-01    3.5
..         ...    ...
364 2020-05-01    6.0
365 2020-06-01    5.9
366 2020-07-01    6.2
367 2020-08-03    5.9
368 2020-09-01    6.0

[369 rows x 2 columns]